sol4ik/audio-steganography/try/fm4/s6e2ccxh/s6e2ccxh.svd
    <!-- PERIPHERAL "BT2" -->
    <peripheral derivedFrom="BT0">
      <name>BT2</name>
      <baseAddress>0x40025080</baseAddress>
      <description>Base Timer 2</description>
      <version>A</version>
      <!-- INTERRUPT "BT2" -->
      <interrupt>
        <name>BT2</name>
        <value>41</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT3" -->
    <peripheral derivedFrom="BT0">
      <name>BT3</name>
      <baseAddress>0x400250C0</baseAddress>
      <description>Base Timer 3</description>
      <version>A</version>
      <!-- INTERRUPT "BT3" -->
      <interrupt>
        <name>BT3</name>
        <value>42</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT4" -->
    <peripheral derivedFrom="BT0">
      <name>BT4</name>
      <baseAddress>0x40025200</baseAddress>
      <description>Base Timer 4</description>
      <version>A</version>
      <!-- INTERRUPT "BT4" -->
      <interrupt>
        <name>BT4</name>
        <value>43</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT5" -->
    <peripheral derivedFrom="BT0">
      <name>BT5</name>
      <baseAddress>0x40025240</baseAddress>
      <description>Base Timer 5</description>
      <version>A</version>
      <!-- INTERRUPT "BT5" -->
      <interrupt>
        <name>BT5</name>
        <value>44</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT6" -->
    <peripheral derivedFrom="BT0">
      <name>BT6</name>
      <baseAddress>0x40025280</baseAddress>
      <description>Base Timer 6</description>
      <version>A</version>
      <!-- INTERRUPT "BT6" -->
      <interrupt>
        <name>BT6</name>
        <value>45</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT7" -->
    <peripheral derivedFrom="BT0">
      <name>BT7</name>
      <baseAddress>0x400252C0</baseAddress>
      <description>Base Timer 7</description>
      <version>A</version>
      <!-- INTERRUPT "BT7" -->
      <interrupt>
        <name>BT7</name>
        <value>46</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT8" -->
    <peripheral derivedFrom="BT0">
      <name>BT8</name>
      <baseAddress>0x40025400</baseAddress>
      <description>Base Timer 8</description>
      <version>A</version>
      <!-- INTERRUPT "BT8" -->
      <interrupt>
        <name>BT8</name>
        <value>98</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT9" -->
    <peripheral derivedFrom="BT0">
      <name>BT9</name>
      <baseAddress>0x40025440</baseAddress>
      <description>Base Timer 9</description>
      <version>A</version>
      <!-- INTERRUPT "BT9" -->
      <interrupt>
        <name>BT9</name>
        <value>99</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT10" -->
    <peripheral derivedFrom="BT0">
      <name>BT10</name>
      <baseAddress>0x40025480</baseAddress>
      <description>Base Timer 10</description>
      <version>A</version>
      <!-- INTERRUPT "BT10" -->
      <interrupt>
        <name>BT10</name>
        <value>100</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT11" -->
    <peripheral derivedFrom="BT0">
      <name>BT11</name>
      <baseAddress>0x400254C0</baseAddress>
      <description>Base Timer 11</description>
      <version>A</version>
      <!-- INTERRUPT "BT11" -->
      <interrupt>
        <name>BT11</name>
        <value>101</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT12" -->
    <peripheral derivedFrom="BT0">
      <name>BT12</name>
      <baseAddress>0x40025600</baseAddress>
      <description>Base Timer 12</description>
      <version>A</version>
      <!-- INTERRUPT "BT12_15" -->
      <interrupt>
        <name>BT12_15</name>
        <value>102</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT13" -->
    <peripheral derivedFrom="BT0">
      <name>BT13</name>
      <baseAddress>0x40025640</baseAddress>
      <description>Base Timer 13</description>
      <version>A</version>
    </peripheral>
    <!-- PERIPHERAL "BT14" -->
    <peripheral derivedFrom="BT0">
      <name>BT14</name>
      <baseAddress>0x40025680</baseAddress>
      <description>Base Timer 14</description>
      <version>A</version>
    </peripheral>
    <!-- PERIPHERAL "BT15" -->
    <peripheral derivedFrom="BT0">
      <name>BT15</name>
      <baseAddress>0x400256C0</baseAddress>
      <description>Base Timer 15</description>
      <version>A</version>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL03" -->
    <peripheral>
      <name>BTIOSEL03</name>
      <description> Base Timer I/O Select</description>
      <version>A</version>
      <groupName>BTIOSEL03</groupName>
      <baseAddress>0x40025100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x1</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL0123" -->
        <register>
          <name>BTSEL0123</name>
          <description>I/O Select Register [BHW]</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL23" -->
            <field>
              <name>SEL23</name>
              <description>I/O select bits for Ch.2/Ch.3</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL01" -->
            <field>
              <name>SEL01</name>
              <description>I/O select bits for Ch.0/Ch.1</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
