sol4ik/audio-steganography/try/fm4/s6e2ccxh/s6e2ccxh.svd
        <!-- REGISTER "PDOR8" -->
        <register>
          <name>PDOR8</name>
          <description>Port Output Data Register 8 [BHW]</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PDOR8</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDOR8</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDOR8</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PDOR8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDOR9" -->
        <register>
          <name>PDOR9</name>
          <description>Port Output Data Register 9 [BHW]</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PDORA" -->
        <register>
          <name>PDORA</name>
          <description>Port Output Data Register A [BHW]</description>
          <addressOffset>0x428</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PF" -->
            <field>
              <name>PF</name>
              <description>Bit15 of PDORA</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of PDORA</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Bit13 of PDORA</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of PDORA</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of PDORA</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of PDORA</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of PDORA</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of PDORA</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of PDORA</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of PDORA</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of PDORA</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of PDORA</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PDORA</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDORA</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDORA</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PDORA</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDORB" -->
        <register>
          <name>PDORB</name>
          <description>Port Output Data Register B [BHW]</description>
          <addressOffset>0x42C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PDORC" -->
        <register>
          <name>PDORC</name>
          <description>Port Output Data Register C [BHW]</description>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PF" -->
            <field>
              <name>PF</name>
              <description>Bit15 of PDORC</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of PDORC</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Bit13 of PDORC</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of PDORC</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of PDORC</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of PDORC</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of PDORC</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of PDORC</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of PDORC</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of PDORC</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of PDORC</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of PDORC</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PDORC</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDORC</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDORC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PDORC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDORD" -->
        <register>
          <name>PDORD</name>
          <description>Port Output Data Register D [BHW]</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDORD</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDORD</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PDORD</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDORE" -->
        <register>
          <name>PDORE</name>
          <description>Port Output Data Register E [BHW]</description>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000D</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PDORE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDORE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PDORE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDORF" -->
        <register>
          <name>PDORF</name>
          <description>Port Output Data Register F [BHW]</description>
          <addressOffset>0x43C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "ADE" -->
        <register>
          <name>ADE</name>
          <description>Analog Input Setting Register [BHW]</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AN31" -->
            <field>
              <name>AN31</name>
              <description>Analog Input Ch.31 Setting Register</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN30" -->
            <field>
              <name>AN30</name>
              <description>Analog Input Ch.30 Setting Register</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN29" -->
            <field>
              <name>AN29</name>
              <description>Analog Input Ch.29 Setting Register</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN28" -->
            <field>
              <name>AN28</name>
              <description>Analog Input Ch.28 Setting Register</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN27" -->
            <field>
              <name>AN27</name>
              <description>Analog Input Ch.27 Setting Register</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN26" -->
            <field>
              <name>AN26</name>
              <description>Analog Input Ch.26 Setting Register</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN25" -->
            <field>
              <name>AN25</name>
              <description>Analog Input Ch.25 Setting Register</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN24" -->
            <field>
              <name>AN24</name>
              <description>Analog Input Ch.24 Setting Register</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN15" -->
            <field>
              <name>AN15</name>
              <description>Analog Input Ch.15 Setting Register</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN14" -->
            <field>
              <name>AN14</name>
              <description>Analog Input Ch.14 Setting Register</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN13" -->
            <field>
              <name>AN13</name>
              <description>Analog Input Ch.13 Setting Register</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN12" -->
            <field>
              <name>AN12</name>
              <description>Analog Input Ch.12 Setting Register</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN11" -->
            <field>
              <name>AN11</name>
              <description>Analog Input Ch.11 Setting Register</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN10" -->
            <field>
              <name>AN10</name>
              <description>Analog Input Ch.10 Setting Register</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN09" -->
            <field>
              <name>AN09</name>
              <description>Analog Input Ch.9 Setting Register</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN08" -->
            <field>
              <name>AN08</name>
              <description>Analog Input Ch.8 Setting Register</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN07" -->
            <field>
              <name>AN07</name>
              <description>Analog Input Ch.7 Setting Register</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN06" -->
            <field>
              <name>AN06</name>
              <description>Analog Input Ch.6 Setting Register</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN05" -->
            <field>
              <name>AN05</name>
              <description>Analog Input Ch.5 Setting Register</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN04" -->
            <field>
              <name>AN04</name>
              <description>Analog Input Ch.4 Setting Register</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN03" -->
            <field>
              <name>AN03</name>
              <description>Analog Input Ch.3 Setting Register</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN02" -->
            <field>
              <name>AN02</name>
              <description>Analog Input Ch.2 Setting Register</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN01" -->
            <field>
              <name>AN01</name>
              <description>Analog Input Ch.1 Setting Register</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN00" -->
            <field>
              <name>AN00</name>
              <description>Analog Input Ch.0 Setting Register</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
