sol4ik/audio-steganography/try/fm4/s6e2ccxh/s6e2ccxh.svd
        <!-- REGISTER "GFC" -->
        <register>
          <name>GFC</name>
          <description>Global Filter Configuration [BHW]</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ANFS" -->
            <field>
              <name>ANFS</name>
              <description>Accept Non-matching Frames Standard</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ANFE" -->
            <field>
              <name>ANFE</name>
              <description>Accept Non-matching Frames Extended</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RRFS" -->
            <field>
              <name>RRFS</name>
              <description>Reject Remote Frames Standard</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RRFE" -->
            <field>
              <name>RRFE</name>
              <description>Reject Remote Frames Extended</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SIDFC" -->
        <register>
          <name>SIDFC</name>
          <description>Standard ID Filter Configuration [BHW]</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LSS" -->
            <field>
              <name>LSS</name>
              <description>List Size Standard</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FLSSA" -->
            <field>
              <name>FLSSA</name>
              <description>Filter List Standard Start Address</description>
              <msb>15</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "XIDFC" -->
        <register>
          <name>XIDFC</name>
          <description>Extended ID Filter Configuration [BHW]</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LSE" -->
            <field>
              <name>LSE</name>
              <description>List Size Extended</description>
              <msb>22</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FLESA" -->
            <field>
              <name>FLESA</name>
              <description>Filter List Extended Start Address</description>
              <msb>15</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "XIDAM" -->
        <register>
          <name>XIDAM</name>
          <description>Extended ID AND Mask [BHW]</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FFFFFFF</resetValue>
          <resetMask>0x1FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EIDM" -->
            <field>
              <name>EIDM</name>
              <description>Extended ID Mask</description>
              <msb>28</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HPMS" -->
        <register>
          <name>HPMS</name>
          <description>High Priority Message Status [BHW]</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLST" -->
            <field>
              <name>FLST</name>
              <description>Filter List</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FIDX" -->
            <field>
              <name>FIDX</name>
              <description>Filter Index</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSI" -->
            <field>
              <name>MSI</name>
              <description>Message Storage Indicator</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BIDX" -->
            <field>
              <name>BIDX</name>
              <description>Buffer Index</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NDAT1" -->
        <register>
          <name>NDAT1</name>
          <description>New Data 1 [BHW]</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ND31" -->
            <field>
              <name>ND31</name>
              <description>New Data flag of Rx Buffer 31</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND30" -->
            <field>
              <name>ND30</name>
              <description>New Data flag of Rx Buffer 30</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND29" -->
            <field>
              <name>ND29</name>
              <description>New Data flag of Rx Buffer 29</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND28" -->
            <field>
              <name>ND28</name>
              <description>New Data flag of Rx Buffer 28</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND27" -->
            <field>
              <name>ND27</name>
              <description>New Data flag of Rx Buffer 27</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND26" -->
            <field>
              <name>ND26</name>
              <description>New Data flag of Rx Buffer 26</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND25" -->
            <field>
              <name>ND25</name>
              <description>New Data flag of Rx Buffer 25</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND24" -->
            <field>
              <name>ND24</name>
              <description>New Data flag of Rx Buffer 24</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND23" -->
            <field>
              <name>ND23</name>
              <description>New Data flag of Rx Buffer 23</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND22" -->
            <field>
              <name>ND22</name>
              <description>New Data flag of Rx Buffer 22</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND21" -->
            <field>
              <name>ND21</name>
              <description>New Data flag of Rx Buffer 21</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND20" -->
            <field>
              <name>ND20</name>
              <description>New Data flag of Rx Buffer 20</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND19" -->
            <field>
              <name>ND19</name>
              <description>New Data flag of Rx Buffer 19</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND18" -->
            <field>
              <name>ND18</name>
              <description>New Data flag of Rx Buffer 18</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND17" -->
            <field>
              <name>ND17</name>
              <description>New Data flag of Rx Buffer 17</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND16" -->
            <field>
              <name>ND16</name>
              <description>New Data flag of Rx Buffer 16</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND15" -->
            <field>
              <name>ND15</name>
              <description>New Data flag of Rx Buffer 15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND14" -->
            <field>
              <name>ND14</name>
              <description>New Data flag of Rx Buffer 14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND13" -->
            <field>
              <name>ND13</name>
              <description>New Data flag of Rx Buffer 13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND12" -->
            <field>
              <name>ND12</name>
              <description>New Data flag of Rx Buffer 12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND11" -->
            <field>
              <name>ND11</name>
              <description>New Data flag of Rx Buffer 11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND10" -->
            <field>
              <name>ND10</name>
              <description>New Data flag of Rx Buffer 10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND9" -->
            <field>
              <name>ND9</name>
              <description>New Data flag of Rx Buffer 9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND8" -->
            <field>
              <name>ND8</name>
              <description>New Data flag of Rx Buffer 8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND7" -->
            <field>
              <name>ND7</name>
              <description>New Data flag of Rx Buffer 7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND6" -->
            <field>
              <name>ND6</name>
              <description>New Data flag of Rx Buffer 6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND5" -->
            <field>
              <name>ND5</name>
              <description>New Data flag of Rx Buffer 5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND4" -->
            <field>
              <name>ND4</name>
              <description>New Data flag of Rx Buffer 4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND3" -->
            <field>
              <name>ND3</name>
              <description>New Data flag of Rx Buffer 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND2" -->
            <field>
              <name>ND2</name>
              <description>New Data flag of Rx Buffer 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND1" -->
            <field>
              <name>ND1</name>
              <description>New Data flag of Rx Buffer 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND0" -->
            <field>
              <name>ND0</name>
              <description>New Data flag of Rx Buffer 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
